/* 
  Localizable.strings
  Tenorshare4DDiG

  Created by Tenorshare on 2022/7/27.
  
*/

"language" = "ar1";
"languageGA" = "ar";

/*******NSMenu title*****/
"About %@" = "حول %@";
"Buy Now" = "اشتري الآن";
"BUY NOW_s" = "اشتري الآن";
"Register" = "تسجيل";
"Check for updates" = "التحقق من التحديثات";
"Service" = "الخدمات";
"Hide %@" = "إخفاء %@";
"Quit %@" = "استقال %@";
"Hide Others" = "إخفاء أخرى";
"Show All" = "عرض الكل";

"Edit" = "تصحيح";
"Undo" = "فك";
"Redo" = "فعل ثانية";
"Cut" = "يقطع";
"Copy" = "نسخ";
"Paste" = "معجون";
"Clear" = "واضح";
"Select All" = "اختر الكل";

"Window" = "نافذة";
"Minimize" = "خفض";
"Zoom" = "Zoom";
"Enter Full Screen" = "أدخل كامل الشاشة";
"Bring All to Front" = "اجلب الجميع للجبهة";

"Help" = "مساعدة";
"Guide" = "دليل";
"Feedback" = "ردود الفعل";
"Support" = "الدعم";

"Open Log" = "عرض السجلا";

//通用按钮title
"OK" = "حسنا";
"Contact us" = "اتصل بنا";
"Save" = "نعم";
"Cancel" = "لا";
"Open" = "فتح";
"Refresh" = "تحديث";

// about window
"Tenorshare %@ %@ Build Date%@" = "Tenorshare %@ %@ تاريخ البناء %@";
"%@ %@ Build Date%@" = "%@ %@ تاريخ البناء %@";
"All Rights Reserved." = "كل الحقوق محفوظة.";

"Tree View" = "عرض الشجرة";
"File View" = "عرض ملف";

//ScanView+Recovery
"Please select the file you want to recover." =
"يرجى تحديد الملف الذي تريد استعادته.";

"Saving files to the partition where you lost them will reduce the chances of a successful recovery. It's recommended to recover the files to a removable disk." =
"سيؤدي حفظ الملفات إلى القسم الذي فقدت به إلى تقليل فرص نجاح الاسترداد. يوصى باسترداد الملفات إلى قرص قابل للإزالة.";

"Saving files to the partition where you lost them will reduce the chances of a successful recovery. Are you sure you want to continue?" =
"سيؤدي حفظ الملفات إلى القسم الذي فقدت به إلى تقليل فرص نجاح الاسترداد. هل أنت متأكد من أنك تريد المتابعة؟";

"Not enough space available on the disk. Additional %@ space is needed to recover these files." =
"لا تتوفر مساحة كافية على القرص. هناك حاجة لمساحة إضافية%@  لاستعادة هذه الملفات. ";

"Recovering: %@" =
"يتعافى:%@";
"Please wait..." =
"أرجو الإنتظار...";

"Recovery completed!" =
"اكتمل الاسترداد!";
"Click Open button to check the recovered files." =
"انقر فوق زر فتح للتحقق من الملفات المستردة.";

"Are you sure you want to stop recovery?" =
"هل أنت متأكد من أنك تريد إيقاف الشفاء؟";

"Failed to save data to the target disk. Please choose another disk and try again." =
"فشل حفظ البيانات إلى القرص الهدف. يرجى اختيار قرص آخر والمحاولة مرة أخرى.";

"Your disk is disconnected. Please reinsert and try again." =
"يتم قطع القرص الخاص بك. يرجى إعادة المحاولة والمحاولة مرة أخرى.";

"Save failed due to disconnection of the target disk. Please reinsert and try again." =
"Sفشل ave بسبب فصل القرص الهدف. يرجى إعادة المحاولة والمحاولة مرة أخرى.";

"Note:" = "ملحوظة: ";
"Please do not save the recovered files to the partition where you lost them. This may cause permanent data loss." =
"الرجاء عدم حفظ الملفات المستردة في القسم الذي فقدت به. قد يتسبب هذا في فقدان دائم للبيانات.";


/*******扫描模块*****/
"All Files" = "كل الملفات";
"Photo" = "الصور";
"Audio" = "السعي";
"Video" = "الفيديو";
"Document" = "الوثيقة";
"Email" = "البريد الإلكتروني";
"Webfile" = "ملف موقع الويب";
"Archive" = "الأرشيف";
"No Extension" = "لا ملحق";
"Others" = "الآخري";
/*"Desktop" = "سطح المكتب";
"Documents" = "مستندات";
"Downloads" = "التنزيلات";*/
"Trash" = "سلة المهملات";
"Lost location" = "الموقع المفقود";
"More" = "أكثر ";
"The scan result will not be saved if you close the program now. Are you sure you want to close?" =
"لن يتم حفظ نتيجة المسح إذا أغلقت البرنامج الآن. هل أنت متأكد من أنك تريد الإغلاق؟";
"YES" = "نعم";
"No" = "لا";
"Are you sure you want to stop scanning?" = "هل أنت متأكد من أنك تريد إيقاف الفحص؟";
"The scan result will not be saved now. Are you sure you want to return Home?" =
"لن يتم حفظ نتيجة الفحص الآن. هل أنت متأكد من أنك تريد العودة إلى المنزل؟";
"Continue" = "استمر";
"Pause" = "وقفة";
"Time remaining: %@" = "الوقت المتبقي: %@";
"Stop" = "توقف";
"Loading search content, please wait…" = "تحميل محتوى البحث ، يرجى الانتظار ...";
"Back" = "إلى الوراء";
"Scanning...(%.1f%%)" = "مسح… (%.1f%%)";
"Scanning..." = "مسح…";
"%li files found (%.1f%%)" = "%li وجدت الملفات (%.1f%%)";
"%li items found, %@" = "%li العثور على العناصر ، %@";
"Selected: %li files, %@" = "المحدد: %li الملفات، %@";
"Home" = "الصفحة الرئيسية";
"Recover" = "استعادة";
"Search" = "بحث";
"Scan completed!" = "اكتمل الفحص!";
"Loading content, please wait..." = "جارٍ تحميل المحتوى ، يرجى الانتظار ...";

"Unlock" = "فتح";
"Password hint: %@"= "تلميح كلمة مرور: %@";
"Password:" = "كلمه السر:";
"Please enter a password to unlock the disk \"%@\"." = "يرجى إدخال كلمة مرور لفتح القرص \"%@\".";
"Wrong password" = "كلمة مرور خاطئة";
"Cancel1" = "إلغاء";

/*******加载窗口模块*****/
"Reading data from the disk, please wait…" = "قراءة البيانات من القرص ، يرجى الانتظار ...";
/*******选择磁盘模块*****/
"Select a location to start data recovery" =
"حدد موقعًا لبدء استرداد البيانات";
"Hard Drives" = "محركات الأقراص الصلبة";
"External Drives" = "محركات أقراص خارجية";
"%@ free of %@" = "%@ خالي من %@";
"Other Location" = "موقع آخر";
"The Whole Computer" = "الكمبيوتر بأكمله";
"UltData" = "UltData";
"To recover data from iOS devices, please switch to UltData-iOS" =
"لاسترداد البيانات من أجهزة iOS ، يرجى التبديل إلى UltData-iOS";
"Scan" = "تفحص";

"To recover data from iOS devices, please switch to UltFone iOS Data Recovery" = "لاسترداد البيانات من أجهزة iOS ، يرجى التبديل إلى UltFone iOS Data Recovery";
"UltFone iOS Data Recovery" = "UltFone iOS Data Recovery";
"Untitled" = "بدون عنوان";

/*******关闭SIP模块*****/
"The selected external drive is not available or uninstalled, please reinsert and try again." =
"محرك الأقراص الخارجي المحدد غير متوفر أو غير مُثبّت ، الرجاء إعادة التضمين والمحاولة مرة أخرى.";
"The selected File System is currently not supported. Please select other disks for data recovery." =
"نظام الملفات المحدد غير مدعوم حاليًا. يرجى تحديد الأقراص الأخرى لاستعادة البيانات.";
"To recover data from \"macOS High Sierra\" disk, please follow steps below to disable System Integrity Protection first." = "لاستعادة البيانات من \"macOS High Sierra\" والأنظمة الأحدث ، تحتاج إلى تعطيل حماية تكامل النظام باتباع الخطوات التالية مقدمًا.
";
"Step 1." = "الخطوة 1.";
"Hold down Command + R on the keyboard immediately when you restart the Mac. Keep holding until the Mac finishes startup process, and you will see the utilities window." =
"اضغط باستمرار على Command + R على لوحة المفاتيح فورًا عند إعادة تشغيل جهاز Mac. استمر في الانتظار حتى ينتهي جهاز Mac من عملية بدء التشغيل ، وستظهر لك نافذة الأدوات المساعدة.";
"Command + R" = "Command + R";
"Note: If you are using iMac/iMac Pro, please use wired keyboard." =
"ملاحظة: إذا كنت تستخدم iMac / iMac Pro ، فالرجاء استخدام لوحة المفاتيح السلكية.";
"Step 2." = "الخطوة 2.";
"Open Terminal from the Utilities menu." =
"افتح طرفية من قائمة الأدوات المساعدة.";
"Terminal" = "طرفية";
"Utilities" = "خدمات";
"Step 3." = "الخطوه 3.";
"Type the following command and hit Enter key to disable SIP. Then restart your Mac again." =
"اكتب الأمر التالي واضغط مفتاح Enter لتعطيل SIP. ثم أعد تشغيل جهاز Mac مرة أخرى.";
"Enter" = "Enter";
"Your Mac will restart during this process. Please take a photo with your phone and save steps." =
"ستتم إعادة تشغيل Mac أثناء هذه العملية. يرجى التقاط صورة بهاتفك وحفظ الخطوات.";
/*******扫描中模块*****/
"Name" = "اسم";
"Created Date" = "تاريخ الإنشاء";
"Modified Date" = "تاريخ معدل";
"Path" = "مسار";
"Type" = "النوع";
"Size" = "بحجم";
"Files not found!" = "الملفات غير موجودة!";
"folder" = "مجلد";
"file" = "ملف";

// 2.7.0新增
"PREV" = "سابق";
"NEXT" = "التالى";
"GO TO" = "اذهب إلى:";
"Didn't find the missing data? Try using Deep Scan." = "ألم تعثر على البيانات المفقودة ؟ حاول استخدام المسح العميق.";
"Deep Scan" = "المسح العميق";
"Previous Scan Results" = "السابق مسح النتيجة";
"Returning to the last scan result requires stopping the current scan. Are you sure you want to stop?" = "يتطلب الرجوع إلى نتيجة الفحص الأخيرة إيقاف الفحص الحالي. هل أنت متأكد من أنك تريد التوقف؟";
"Stop" = "توقف";
"Cancel" = "إلغاء";
"Deep scan completed!" = "مسح عميق الانتهاء!";
"OK" = "حسنا";
"Loading content, please wait…" = "جارٍ تحميل المحتوى ، يرجى الانتظار …";
"View Deep Scan Results" = "عرض نتائج مسح عميق";
"List View" = "عرض قائمة";
"Thumbnail" = "المصغرات";
"Preview Pane" = "جزء المعاينة";
"Preview" = "معاينة";
"This format file does not support to preview." = "لا يدعم ملف التنسيق هذا المعاينة.";
"This file may be corrupt and can't be previewed." = "قد يكون هذا الملف تالفًا ولا يمكن معاينته.";
"File size that exceeds 8 MB does not support to preview." = "حجم الملف الذي يتجاوز 8 ميجابايت لا يدعم المعاينة.";
"The lost data may be damaged at any time and cannot be recovered. It is recommended to recover them earlier for higher recovery rate." = "قد تتلف البيانات المفقودة في أي وقت ولا يمكن استردادها. يوصى باستعادتها مسبقًا للحصول على معدل استرداد أعلى.";
"Buy now to save 70%" = "اشتر الآن لتوفير 70%";
"Unlimited Data Recovery" = "غير محدود استعادة البيانات";
"Recover your valuable data easily and quickly." = "استرجع بياناتك القيمة بسهولة وبسرعة.";
"Multiple File Types" = "أنواع الملفات المتعددة";
"Recover 550+ types of files from hard drive, memory card, etc." = "استرجع جميع أنواع الملفات ، بما في ذلك الصور ومقاطع الفيديو والمستندات والملفات الأخرى.";
"Professional Support" = "الدعم المهني";
"Provide professional and quality customer support." = "تقديم دعم العملاء المهنية والجودة.";
"Free Update" = "تحديث مجاني";
"Enjoy free update within license validity." = "استمتع بالتحديث المجاني ضمن صلاحية الترخيص.";
"Already have a registration code? Register now" = "لديك بالفعل رمز التسجيل؟ سجل الان";
"Register now" = "سجل الان";
"To recover data from crashed computer, please click here." = "لاستعادة البيانات من ويندوز المحطمة ، يرجى الضغط هنا.";
"click here" = "يرجى الضغط هنا";
"Creating a bootable drive using an SD card is not supported. Please use another storage device to create the bootable drive." = "إنشاء محرك أقراص قابل للتشغيل باستخدام بطاقة SD غير مدعوم. يرجى استخدام جهاز تخزين آخر لإنشاء محرك أقراص قابل للتمهيد.";

"Recover from Crashed System" = "يتعافى من تحطم النظام";
"Support to recover files from crashed system." = "دعم لاستعادة الملفات من نظام تحطمت.";
"Recover Data from Crashed System" = "استعادة البيانات من نظام تحطمها";
"Recover lost files from crashed computer" = "استعادة الملفات المفقودة من جهاز الكمبيوتر المحطم";
"To recover data from iOS devices, please switch to iOS Data Recovery" = "لاسترداد البيانات من أجهزة iOS ، يرجى التبديل إلى iOS Data Recovery";
"Please select a USB flash drive/external hard drive" = "يرجى اختيار محرك أقراص فلاش USB / محرك أقراص ثابت خارجي";
"Creating bootable drive…" = "إنشاء محرك أقراص قابل للتشغيل";
"The bootable drive is created successfully!" = "تم إنشاء محرك الأقراص القابل للتشغيل بنجاح!";
"Please select a USB flash drive/external hard drive to create a bootable drive" = "يرجى اختيار محرك أقراص فلاش USB / محرك أقراص ثابت خارجي لإنشاء محرك أقراص قابل للتمهيد";
"Insert a USB flash drive/external hard drive to create a bootable drive, and then recover data from crashed system by the bootable drive." = "أدخل محرك أقراص فلاش USB / محرك أقراص ثابتًا خارجيًا لإنشاء محرك أقراص قابل للتمهيد ، ثم قم باستعادة البيانات من النظام المعطوب بواسطة محرك الأقراص القابل للتمهيد.";
"Bootable drive:" = "محرك للتمهيد:";
"Refresh" = "تحديث";
"Note: Creating a bootable drive will format all data in the selected disk. Please back up your important data in advance." = "ملاحظة: سيؤدي إنشاء محرك أقراص قابل للتشغيل إلى تنسيق جميع البيانات الموجودة على القرص المحدد. يرجى عمل نسخة احتياطية من البيانات الهامة الخاصة بك مقدما.";
"Return" = "إرجاع";
"Start" = "الابتداء";
"OK" = "حسنا";
"Creating a bootable drive will format all data in the selected disk. Are you sure you want to continue?" = "سيؤدي إنشاء محرك أقراص قابل للتمهيد إلى تنسيق جميع البيانات الموجودة على القرص المحدد. هل أنت متأكد أنك تريد المتابعة؟";
"Cancel" = "لا";
"The total disk space is less than 2GB. Please use a larger USB drive/external hard drive to create the bootable drive." = "إجمالي مساحة القرص أقل من 2 جيجابايت. الرجاء استخدام محرك أقراص USB أكبر / محرك أقراص ثابت خارجي لإنشاء محرك أقراص قابل للتمهيد.";
"The local disk space is less than 2GB and the boot system image cannot be downloaded. Please free up some disk space before downloading." = "تبلغ مساحة القرص المحلي أقل من 2 غيغابايت ولا يمكن تنزيل صورة نظام التمهيد. يرجى تحرير بعض مساحة القرص قبل التنزيل.";
"Formatting the bootable drive, please wait…" = "تهيئة محرك الأقراص القابل للتمهيد ، يرجى الانتظار ...";
"When formatting the bootable drive, please do not operate or eject it." = "عند تهيئة محرك الأقراص القابل للتمهيد ، يرجى عدم تشغيله أو إخراجه.";
"To avoid the burned disk be damaged, please be patient and wait for the burn to complete." = "لتجنب تلف القرص المحروق ، يرجى التحلي بالصبر والانتظار حتى يكتمل النسخ.";
"Creating bootable drive, please wait…" = "إنشاء محرك أقراص قابل للتمهيد ، يرجى الانتظار ...";
"When creating the bootable drive, please do not operate the disk or eject it." = "عند إنشاء محرك الأقراص القابل للتمهيد ، يرجى عدم تشغيل القرص أو إخراجه.";
"Follow the steps below to use the bootable drive to boot a Mac that cannot be turned on." = "اتبع الخطوات الموضحة أدناه لاستخدام محرك الأقراص القابل للتمهيد لتشغيل نظام التشغيل Mac الذي لا يمكن تشغيله.";
"bootable drive" = "للتمهيد";
"cannot be turned on" = "يمكن تشغيله";
"black screen" = "ببدء تشغيل";
"Option key" = "مفتاح Option";
"%@ bootable drive" = "للتمهيد %@";
"Step 1: Insert the bootable drive into a Mac that cannot be turned on." = "الخطوة 1: أدخل محرك الأقراص القابل للتمهيد في جهاز Mac لا يمكن تشغيله.";
"Step 2: Start the computer that cannot be turned on. When the Mac is in a black screen, press and hold the Option key. Release the Option key until you see the bootable drive." = "الخطوة 2: قم ببدء تشغيل الكمبيوتر الذي لا يمكن تشغيله. عندما يكون Mac في شاشة سوداء ، اضغط مع الاستمرار على مفتاح Option. حرر المفتاح Option حتى ترى محرك الأقراص القابل للتمهيد.";
"Step 3: On the Select bootable drive interface, select the %@ bootable drive." = "الخطوة 3: على واجهة تحديد محرك أقراص قابل للتشغيل ، حدد محرك الأقراص القابل للتمهيد %@.";
"click here" = "هنا";
"To see the detailed steps, please click here." = "للاطلاع على الخطوات التفصيلية ، يرجى النقر هنا.";
"Bootable drive creation failed!" = "فشل إنشاء محرك للتمهيد!";
"Contact Us" = "اتصال بنا";
"Bootable drive creation failed! Please check if your disk is disconnected. You can click the Retry button or Contact Us." = "فشل إنشاء محرك للتمهيد! يرجى التحقق مما إذا كان القرص غير متصل. يمكنك النقر فوق الزر \"إعادة المحاولة\" أو اتصال بنا.";
"Retry" = "إعادة المحاولة";

"Select USB/external hard drive" = "حدد USB أو محرك الأقراص الصلبة الخارجي";
"Completed!" = "منجز!";
"Format" = "شكل";


// 3.0.1
"Please enter login password to allow disk access." = "الرجاء إدخال كلمة مرور تسجيل الدخول للسماح بالوصول إلى القرص.";

"note:" = "ملحوظة:";
"1. If you have not received the registration code or don't know the register E-mail address, please click here to check." = "1. إذا لم تستلم رمز التسجيل أو لا تعرف عنوان البريد الإلكتروني الخاص بالتسجيل ، فيرجى النقر هنا للتحقق.";
"2. For other software or registration issues, please visit support center." = "2. بالنسبة إلى مشكلات البرامج أو التسجيل الأخرى ، يرجى زيارة مركز الدعم.";
"click here to check" = "النقر هنا للتحقق";
"visit support center" = "زيارة مركز الدعم";
"To recover data from the \"macOS Catalina\" and later systems, Please follow the steps below to allow %@ to access removable volumes" = "لاستعادة البيانات من \"macOS Catalina\" والأنظمة الأحدث ، يرجى اتباع الخطوات أدناه للسماح لـ %@ بالوصول إلى وحدات التخزين القابلة للإزالة";
"Step 1 :" = "الخطوة 1 :";
"Step 2 :" = "الخطوة 2 :";
"Step 3 :" = "الخطوه 3 :";
"On your Mac, choose Apple menu  > System Preferences, click Security & Privacy." = "على الـ Mac الخاص بك ، اختر قائمة Apple> تفضيلات النظام ، انقر فوق الأمان والخصوصية.";
"Select the \"Removable Volumes\" checkbox below %@." = "حدد مربع الاختيار \"وحدات التخزين القابلة للإزالة\" أسفل %@.";
"Click \"Later\" to allow %@ to access removable volumes." = "انقر على \"لاحقًا\" للسماح لـ %@ بالوصول إلى وحدات التخزين القابلة للإزالة.";
"Settings" = "الإعدادات";
"OK" = "تؤكد";
"To create a startup disk in \"macOS Catalina\" and later versions, Please follow the steps below to allow %@ to access removable volumes" =
"لإنشاء قرص بدء تشغيل في \"macOS Catalina\" والإصدارات الأحدث ، يرجى اتباع الخطوات أدناه للسماح لـ %@ بالوصول إلى وحدات التخزين القابلة للإزالة";


"Sorry. Firmware downloading failed due to insufficient hard disk. Please release enough space (about %@) in your hard disk and then download again." = "عفوا ، فشل تحميل البرامج الثابتة بسبب عدم كفاية القرص الثابت. الرجاء تحرير مساحة كافية (حوالي %@ غيغابايت) في القرص الثابت ثم التنزيل مرة أخرى.";
"This file path cannot save the firmware. Please change to the correct one." = "لا يمكن لمسار الملف هذا حفظ البرامج الثابتة. يرجى التغيير إلى الصحيح.";
"Failed to download firmware package! Please check your Internet connection and try again." = "أخفق تنزيل حزمة البرامج الثابتة! يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.";
"Downloading the firmware, please wait…" = "جارٍ تنزيل البرنامج الثابت ، الرجاء الانتظار ...";
"Please make sure the network connection is normal." = "يرجى التأكد من أن اتصال شبكة الكمبيوتر طبيعي.";
"Network Abnormal! Please check your network and try again." = "خطأ في الشبكة! يرجى التحقق من الشبكة والمحاولة مرة أخرى.";
"Try Again" = "أعد المحاولة";
"There is not enough space to download the firmware. Please free up at least 1 GB of free space and try again." = "لا توجد مساحة تخزين كافية لتنزيل البرامج الثابتة. يُرجى تحرير 1 غيغابايت على الأقل من مساحة التخزين المجانية وإعادة المحاولة.";
"Your Mac is equipped with Apple T2 Security Chip, files under the APFS file system cannot be scanned out." = "جهاز Mac الخاص بك مزود بشريحة أمان Apple T2 ، ولا يمكن فحص الملفات الموجودة ضمن نظام ملفات APFS.";
"Failed to download firmware package! Please check your internet connection and try again." = "فشل تنزيل البرنامج الثابت ، يرجى التحقق من الشبكة والمحاولة مرة أخرى!";
"Fast Scan done! Finding more lost data with Deep Scan..." = "اكتمل الفحص السريع! نحاول الآن العثور على المزيد من البيانات المفقودة باستخدام الفحص العميق.";
"Deep Scanning" = "تفحص بعمق";
"Fast Scanning:" = "مسح سريع";
"RAW Files" = "ملفات RAW";
"Tag Files" = "ملفات Tag";
"Deleted Files" = "الملفات المحذوفة";
"Lost Location" = "الموقع المفقود";
"Existing Files" = "الملفات الموجودة";

//mark:4.0.0
"Found %li files. More useful tips below for finding files:" = "تم العثور على٪ li من الملفات لك. فيما يلي بعض الأساليب الفعالة للعثور على الملفات:";
"File Path Not Found" = "الملفات التي لم يتم العثور على المسار الأصلي فيها";
"File Name Not Found" = "الملفات التي لم يتم العثور على أسماء ملفاتها";
"Tagged Files" = "الملفات الموسومة";
"You may find your accidentally deleted files here." = "يمكنك العثور على الملفات التي تم حذفها عن طريق الخطأ هنا";
"There are deleted files that lost their original path. You can check file names to see if they are target files." = "هذه أيضًا ملفات محذوفة عن طريق الخطأ، لكن لا يمكنها تحديد المسار الأصلي للملفات، ويمكنك تحديد ما إذا كانت هذه الملفات هي الملفات التي تريدها بواسطة أسماء الملفات.";
"There are files that lost their original names. You can preview them to see if they are target files." = "فقدت هذه الملفات أسماء ملفاتها الأصلية، ويمكنك معاينة الملفات لمعرفة ما إذا كانت الملفات هي التي تريدها.";
"You may find target files here if you lost them which are not deleted before." = "إذا لم تحذف الملف ووجدت أنه مفقود، فمن المحتمل أن يتم حفظ هذا الملف هنا.";
"Lost files without name will be renamed and classified here with corresponding tags." = "بالنسبة لبعض الملفات التي فقدت أسماء ملفاتها، سنقوم بتسميتها وتصنيفها وفقًا لعلاماتها.";
"Unable to preview. Please recover and save it on your computer for further checking." = "الملف لا يدعم المعاينة، يرجى استعادته وحفظه على جهاز الكمبيوتر الخاص بك لمزيد من الفحص.";
"Trying to find more data... You can search and recover your data now." = "محاولة العثور على المزيد من البيانات ... يمكنك البحث عن البيانات الخاصة بك واستعادتها الآن.";
"Didn't find the missing files? Try Deep Scan." = "لم تجد ملفك المفقود؟ الرجاء محاولة الفحص العميق!";
"The Deep Scan can scour the device inch by inch to find the deeply buried files, enabling a higher recovery rate." = "سيبحث الفحص العميق عن الملفات المخفية في الجهاز بمزيد من التفاصيل ، مما يزيد من احتمالية استرداد الملفات.";
"Artist" = "فنان";
"Camera" = "كاميرا";
"The Last Editor" = "المحرر الأخير";
"Creation Time" = "وقت الابتكار";
"Modified Time" = "الوقت المعدل";
"All Time" = "كل الوقت";
"Last 24 hours" = "أخر 24 ساعه";
"Last 7 days" = "اخر 7 ايام";
"Last 30 days" = "آخر 30 يومًا";
"Customize" = "الإعدادات المخصصة";
"Selected" = "المحدد";
"File Size" = "حجم الملف";
"All Size" = "جميع الاحجام";
"Improve Chances of Finding Lost Files" = "يزيد من احتمال العثور على الملفات المفقودة";
"Refer to the \"Tagged Files\" and \"File Name Not Found\" under the Tree View." = "راجع \"الملفات ذات العلامات\" و \"لم يتم العثور على اسم الملف\" ضمن عرض الشجرة.";
"Filter files by File Type, File Size, Date Modified, and more." = "تصفية الملفات حسب نوع الملف وحجم الملف وتاريخ التعديل والمزيد.";
"Upgrade to Pro Version to Recover Your Valuable Data!" = "قم بالترقية إلى الإصدار المحترف لاستعادة بياناتك الثمينة!";
"Get the Pro Version to Create a Bootable Drive for Data Recovery!" = "قم بالترقية إلى الإصدار المحترف لإنشاء أقراص تمهيد قابلة للاسترداد للبيانات!";
"Free Version" = "نسخة مجانية";
"Pro Version" = "نسخة للمحترفين";
"Preview Just a Few Files" = "معاينة ملفات قليلة";
"Preview All Files" = "معاينة كافة الملفات";
"Free Upgrade" = "ترقية مجانية";
"Recover Data from the Crashed Computer" = "استعادة البيانات من الكمبيوتر المعطل";
"Only Allows You to Scan Disks" = "يسمح لك فقط بفحص الأقراص";
"Unlimited Data Recovery" = "استعادة البيانات غير المحدودة";
"Professional Customer Service" = "خدمة عملاء احترافية";
"Professional and reliable data recovery solutions" = "حلول استرجاع بيانات احترافية وموثوقة";
"Advanced Options" = "خيارات متقدمة";
"Local Drives" = "محركات الأقراص المحلية";
"External Drives" = "محركات خارجية";
"Common Location" = "الموقع المشترك";
"Data Recovery" = "استعادة البيانات";
"Fast and Safe" = "سريع وآمن";
"Failed to read the disk data, please re-plug the external disk." = "فشلت قراءة بيانات القرص، يرجى إعادة توصيل القرص الخارجي.";
"Please remove all external disks connected to the computer, and then reinsert the disk that needs data recovery." = "يرجى فصل جميع الأقراص الخارجية المتصلة بالكمبيوتر ، ثم إعادة إدخال القرص الذي تريد استرداده.";
"Still have problems? Please contact us." = "هل ما زلت لم تحل المشكلة؟ الرجاء التواصل معنا.";
"To recover data from digital camera, please remove the SD card and connect it to computer via card reader." = "عند استعادة بيانات الكاميرا، يرجى إدخال بطاقة SD في قارئ البطاقة ثم محاولة استعادة البيانات.";
"Found nothing..." = "لم يتم العثور على شيء ...";
"1. Wait for the scan to finish before searching again." = "1. انتظر حتى يكتمل الفحص ثم أعد المسح مرة أخرى.";
"2. Your file is most likely missing the filename. Try searching in this way." = "2. من المحتمل أن يكون ملفك مفقودًا في اسم الملف، يرجى محاولة البحث بهذه الطريقة.";
"3. Make sure the term you're looking for is spelled correctly." = "3. تأكد من صحة مصطلح البحث الذي أدخلته.";
"4. If none of the above methods help, please contact us." = "4. إذا لم تساعد أي من الطرق المذكورة أعلاه ، يرجى الاتصال بنا";
"Reading data from the disk，please wait…" = "جاري قراءة بيانات القرص، برجاء الانتظار ...";
"Stuck in refreshing status for a long time?" = "عالق في حالة منعشة لفترة طويلة؟";
"Effortlessly Recover Data from A Crashed Computer" = "استعادة البيانات من النظام المعطل";
"View Files" = "عرض الملفات المستردة";
"It might take a long time to export for some files need repairing..." = "تحتاج بعض الملفات إلى الإصلاح، وقد يستغرق وقت التصدير وقتًا أطول قليلاً، يرجى التحلي بالصبر ...";
"contact us" = "الاتصال بنا";
"in this way" = "بهذه الطريقة";
"Exit App" = "الخروج من التطبيق";
"Recovered: %li file %@" = "تم استرداد:% li ملفات %@";
"Recovered: %li files %@" = "تم استرداد:% li ملفات %@";
"File Types" = "أنواع الملفات";
"File Tags" = "علامات الملف";
"Move your mouse to the icon under Tree View, and you'll learn the explanation of each file category." = "حرك الماوس إلى الرقم الموجود أسفل Tree View، وتتعرف على شرح لكل فئة ملف.";
"Understood" = "مفهوم";
"Filter" = "تصفية";
"Reset" = "إعادة ضبط";
"Scan Stopped!" = "توقف المسح!";
"Tips:" = "نصائح:";
"1. Please replug the external drive or change another drive and then try again." = "1. يرجى إعادة توصيل محرك الأقراص الخارجي أو تغيير محرك أقراص آخر ثم المحاولة مرة أخرى.";
"2. Please make sure internet connection is working properly." = "2. يرجى التأكد من أن اتصال الإنترنت يعمل بشكل صحيح.";

// V5.0.0
"Get An Extra" = "تمتع بمزايا إضافية";
"Coupon Code:" = "رمز الكوبون:";
"Copy and paste the coupon code at checkout to redeem." = "انسخ والصق رمز القسيمة عند الخروج للاسترداد.";
"Copy and Buy Now" = "انسخ واشتري الآن";
"Close Program" = "اغلق البرنامج";
"Photo Repair" = "إصلاح الصور";
"Video Repair" = "إصلاح الفيديو";
"Repair Damaged Videos in Just Three Steps!" = "قم بإصلاح مقاطع الفيديو التالفة في ثلاث خطوات فقط!";
"Repair Damaged Photos in Just Three Steps!" = "قم بإصلاح الصور التالفة في ثلاث خطوات فقط!";
"Import Video" = "أضف الفيديو";
"Import Photo" = "أضف الصور";
"Start Repairing" = "ابدأ الإصلاح";
"Repair Done!" = "تم الإصلاح!";
"Click to Add Photos" = "انقر لإضافة الصور";
"Click to Add Videos" = "انقر لإضافة  الفيديو";
"%liPhoto Added，%@KB" = "تمت إضافة %li صور،%@.";
"%liVideo Added，%@KB" = "تمت إضافة %li فيديو،%@.";
"%liPhotos Added，%@KB" = "تمت إضافة %li صور،%@.";
"%liVideos Added，%@KB" = "تمت إضافة %li فيديو،%@.";
"Add Photo" = "إضافة صورة";
"Add Video" = "أضف فيديو";
"Home" = "صفحة الرئيسية";
"Repair" = "إصلاح";
"Remove All Image" = "إزالة جميع الصور";
"Remove All Video" = "إزالة جميع الفيديو";
"This photo can't be repaired." = "لا يمكن إصلاح هذه الصورة.";
"This video can't be repaired." = "لا يمكن إصلاح هذا الفيديو.";
"Select all successfully repaired photos" = "حدد جميع الصور التي تم إصلاحها بنجاح";
"Reselect photo to repair" = "إعادة تحديد الصورة";
"Select all successfully repaired videos" = "حدد جميع الفيديو التي تم إصلاحها بنجاح";
"Reselect video to repair" = "إعادة تحديد الفيديو";
"We've found several photos from this photo that you might be looking for, and you can preview and export them." = "لقد وجدنا العديد من الصور من هذه الصورة التي ربما تبحث عنها، ويمكنك معاينتها وتصديرها.";
"We've found several videos from this video that you might be looking for, and you can preview and export them." = "لقد وجدنا العديد من مقاطع الفيديو من هذا الفيديو التي ربما تبحث عنها، ويمكنك معاينتها وتصديرها.";
"Are you sure you want to remove all photos?" = "هل أنت متأكد أنك تريد إزالة كل الصور؟";
"Are you sure you want to remove all videos?" = "هل أنت متأكد أنك تريد إزالة كل الفيديو؟";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "هل أنت متأكد أنك تريد العودة إلى الصفحة الرئيسية؟ لن يتم حفظ تقدم الإصلاح الحالي.";
"Are you sure you want to return to the home page? The current repair progress will not be saved." = "هل أنت متأكد أنك تريد العودة إلى الصفحة الرئيسية؟ لن يتم حفظ تقدم الإصلاح الحالي.";
"Are you sure you want to reselect the video? The current repair progress will not be saved." = "هل أنت متأكد أنك تريد إعادة تحديد الفيديو؟ لن يتم حفظ تقدم الإصلاح الحالي.";
"Are you sure you want to reselect the photo? The current repair progress will not be saved." = "هل أنت متأكد أنك تريد إعادة تحديد الصور؟ لن يتم حفظ تقدم الإصلاح الحالي.";
"Some videos are already in the repair list and will not be imported repeatedly." = "بعض مقاطع الفيديو موجودة بالفعل في قائمة الإصلاح، ولن يتم استيرادها مرة أخرى.";
"Some photos are already in the repair list and will not be imported repeatedly." = "بعض الصور موجودة بالفعل في قائمة الإصلاح، ولن يتم استيرادها مرة أخرى.";
"The video has been lost, please re-import and try previewing again." = "تم فقد الفيديو، يرجى إعادة الاستيراد ثم محاولة المعاينة.";
"The photo has been lost, please re-import and try previewing again." = "تم فقد الصور، يرجى إعادة الاستيراد ثم محاولة المعاينة.";
"Scanning or recovery cannot continue because the device is disconnected, please re-plug the device and click Continue." = "لا يمكن أن يستمر المسح أو الاسترداد لأن الجهاز غير متصل، يرجى إعادة توصيل الجهاز والنقر فوق متابعة.";
"Repairing：" = "إصلاح:";
"Please wait..." = "أرجو الإنتظار...";
"Exporting:" = "تصدير:";
"The device has been disconnected, you can try to select data to recover or rescan." = "تم فصل الجهاز، يمكنك محاولة تحديد البيانات لاستعادتها أو إعادة فحصها.";
"Continue" = "استمر";
"Retry" = "حاول مرة أخرى";
"Stop" = "توقف";
"Export Completed!" = "اكتمل التصدير!";
"Export: %lifiles(%@)" = "التصدير:%li الملفات (%@)";
"View Exported" = "عرض ملف التصدير";
"There are still %li videos to export, are you sure you want to stop exporting?" = "لا يزال هناك٪ li من مقاطع الفيديو في انتظار أن يتم تصديرها. هل تريد بالتأكيد إيقاف التصدير؟";
"There are still %li photos to export, are you sure you want to stop exporting?" = "لا يزال هناك٪ li من الصور في انتظار أن يتم تصديرها. هل تريد بالتأكيد إيقاف التصدير؟";
"There are still 1 video to export, are you sure you want to stop exporting?" = "لا يزال هناك فيديو واحد للتصدير، هل أنت متأكد أنك تريد إيقاف التصدير؟";
"There are still 1 photo to export, are you sure you want to stop exporting?" = "لا يزال هناك الصور واحد للتصدير، هل أنت متأكد أنك تريد إيقاف التصدير؟";
"Are you sure you want to stop exporting?" = "هل أنت متأكد أنك تريد إيقاف التصدير؟";
"Upgrade to Pro version to preview files!" = "قم بالترقية إلى الإصدار المحترف لمعاينة الملفات!";
"Upgrade" = "ترقية";
"The unregistered version can only play the first 30s of the audio file, upgrade to the registered version for full playback." = "يمكن للنسخة غير المسجلة تشغيل أول 30 ثانية فقط من الملف الصوتي، ويمكن تشغيلها بالكامل بعد الترقية إلى الإصدار الاحترافي.";
"The unregistered version can only play the first 10s of the video file, upgrade to the registered version for full playback." = "يمكن للنسخة غير المسجلة تشغيل أول 10 ثانية فقط من الملف الفيديو ويمكن تشغيلها بالكامل بعد الترقية إلى الإصدار الاحترافي.";
"Upgrade to Pro Version to Export your Valuable Photos!" = "احصل على النسخة الاحترافية لتصدير صورك الثمينة!";
"Upgrade to Pro Version to Export your Valuable Videos!" = "احصل على النسخة الاحترافية لتصدير فيديوك الثمينة!";
"Support for exporting repaired files" = "يمكن تصدير الملفات التي تم إصلاحها";

//MARK: - 第二版
"The file can't be previewed, please export it and try to preview it again." = "لا يمكن معاينة الملف ، يرجى تصديره ومحاولة معاينته مرة أخرى.";
"The file can't be previewed, please repair it and try to preview it again." = "لا يمكن معاينة الملف، يرجى إصلاحه ومحاولة معاينته مرة أخرى.";
"Are you sure you want to exit the program? Current repair progress will not be retained." = "هل أنت متأكد أنك تريد الخروج من البرنامج؟ لن يتم الاحتفاظ بتقدم الإصلاح الحالي.";
"There are still %li videos waiting to be repaired, are you sure you want to stop the repair?" = "لا يزال هناك% li من الفيديو في انتظار الإصلاح، هل أنت متأكد من رغبتك في إيقاف الإصلاح؟";
"There are still %li photos waiting to be repaired, are you sure you want to stop the repair?" = "لا تزال هناك% li من الصور في انتظار الإصلاح، هل أنت متأكد من رغبتك في إيقاف الإصلاح؟";
"There is still 1 video waiting to be repaired, are you sure you want to stop the repair?" = "لا يزال هناك فيديو واحد في انتظار الإصلاح، هل أنت متأكد من أنك تريد إيقاف الإصلاح؟";
"There is still 1 photo waiting to be repaired, are you sure you want to stop the repair?" = "لا تزال هناك صورة واحدة في انتظار الإصلاح، هل تريد بالتأكيد إيقاف الإصلاح؟";
"Are you sure you want to stop repairing?" = "هل متأكد أنك تريد التوقف عن الإصلاح؟";
"Repair done!" = "الإصلاح بنجاح!";
"Repaired: %li files (%@)" = "تم إصلاحه:% li ملفات (%@)";
"View Repair Results" = "عرض نتائج الإصلاح";
"Export" = "التصدير";
"The video has been lost, please re-repair and try exporting again." = "تم فقد الفيديو، يرجى إعادة الإصلاح ومحاولة التصدير مرة أخرى.";
"The photo has been lost, please re-repair and try exporting again." = "تم فقد الصورة، يرجى إعادة الإصلاح ومحاولة التصدير مرة أخرى.";
"The video has been lost, please re-import and try repairing again." = "تم فقد الفيديو، يرجى إعادة الاستيراد ومحاولة الإصلاح مرة أخرى.";
"The photo has been lost, please re-import and try repairing again." = "تم فقد الصورة، يرجى إعادة الاستيراد ومحاولة الإصلاح مرة أخرى.";
"Selected: %li photo  (%@)" = "لقد اختيار:%li صور (%@)";
"Selected: %li photos  (%@)" = "لقد اختيار:%li صور (%@)";
"Selected: %li video  (%@)" = "لقد اختيار: %li من مقاطع الفيديو (%@)";
"Selected: %li videos  (%@)" = "لقد اختيار: %li من مقاطع الفيديو (%@)";
"%li Results" = "%li النتائج";
"Close" = "إغلاق";


"Match Similar Files" = "تطابق ملفات مماثلة";
"We've found some files that might be what you want, you can preview and restore them." = "وجدنا لك بعض الملفات الأخرى التي قد تكون ما تريده، انقر لعرضها واستعادتها.";
"Sorry, no matching files were found at this time. You can wait for the scan to finish and try again, or use Filter, Search Bar to find the files you want." = "عفوا، لم يتم العثور على ملفات أخرى مطابقة. يمكنك المحاولة مرة أخرى بعد اكتمال الفحص، أو إعادة المسح باستخدام التصفية والبحث والمزيد.";
"What Type of Files Do You Want to Recover?" = "ما نوع الملفات التي تريد استعادتها؟";
"Filtering file type helps recover the files you want faster" = "استخدم ميزة التصفية للمساعدة في العثور على الملف الذي تريده واستعادته بشكل أسرع.";
"Others" = "آخر";
"Other Types" = "أنواع أخرى";
"%@ etc." = "%@ إلخ.";
"Scan Selected File Types" = "فحص أنواع الملفات المحددة";
"Scan All File Types" = "فحص جميع أنواع الملفات";
"Scan Only %@" = "مسح فقط%@";


//MARK: - 预览
"Preview" = "معاينة";
"Loading..." = "...تحميل";
"Preview is not available. Recover it for view" = "المعاينة غير متاحة. استعادتها للعرض";
"Max size for preview: 30MB. Recover it for view" = "الحد الأقصى لحجم المعاينة: 30 MB. استعادتها للعرض";
"Format not supported for preview. Recover it for view" = "التنسيق غير مدعوم للمعاينة. استعادتها للعرض";
"%@ files zipped in total" = "يوجد إجمالي %@ ملف مضغوط";
"AI Repairing..." = "...يجري إصلاح AI";
"It may take a while, but it's worth the wait" = "قد يستغرق الأمر بعض الوقت، لكنه يستحق الانتظار";
"AI Repaired %@" = "%@ بعد إصلاح AI";
"Repaired successfully. Recover the repaired file" = "تم الإصلاح بنجاح. استعادة الملف الذي تم إصلاحه";
"Get Pro for Full Preview" = "احصل على المحترفين للمعاينة الكاملة";
"Preview full file" = "معاينة الملف كاملا";
"Recover unlimited files" = "استعادة ملفات غير محدودة";
"AI Repair corrupte files" = "إصلاح الملفات التالفةAI";
"Premium technical support" = "دعم فني متميز";
"Get Pro Now" = "احصل على المحترفين الآن";
"Details" = "تفاصيل";
"Icon" = "أيقونة";


//MARK: - 付费升级弹窗
"Get Pro for Unlimited Recovery" = "احصل على Pro لاستعادة غير محدودة";
"Preview only." = "معاينة فقط.";
"No free recovery remaining." = "لا يوجد استرداد مجاني متبقي.";
"Unlock Pro to enjoy full features, unlimited recovery and more benefits." = "افتح Pro للاستمتاع بالميزات الكاملة والاسترداد غير المحدود والمزيد من الفوائد.";
"Get Pro for Unlimited Repair" = "احصل على Pro لإصلاح غير محدود";
"Unlock Pro to enjoy full features, unlimited repair and more benefits." = "افتح Pro للاستمتاع بالميزات الكاملة والإصلاح غير المحدود والمزيد من الفوائد.";
"Trial" = "محاكمة";
"Free" = "مجاني";
"Pro" = "Pro";
"Preview only" = "معاينة فقط";
"Unlimited" = "غير محدود";
"Key Features & Benefits" = "الميزات والفوائد الرئيسية";
"Recovery amount" = "مبلغ استعادة";
"Preview before recovery" = "المعاينة قبل الاسترداد";
"Recover while scanning" = "استعادة أثناء المسح";
"Recover data from crashed system" = "استعادة البيانات من النظام المعطل";
"Recover data from NAS server" = "استعادة البيانات من خادم NAS";
"Repair corrupted vidoes & photos" = "إصلاح مقاطع الفيديو والصور التالفة";
"Enjoy lifetime updates for free" = "استمتع بالتحديثات مدى الحياة مجانًا";
"24/7 premium technical support" = "دعم فني متميز على مدار 24 ساعة طوال أيام الأسبوع";
"30-day money back guarantee" = "ضمان استعادة الأموال لمدة 30 يومًا";
"Buy Now" = "اشتري الآن";
"Already Purchased?" = "مباع؟";
"Register Now to proceed with recovering ( no need to rescan)." = "سجل الآن لمتابعة عملية الاسترداد (لا حاجة لإعادة المسح).";
"Register Now" = "سجل الآن";
"Recover the repaired file" = "استعادة الملف الذي تم إصلاحه";
"Recover it for view" = " استعادتها للعرض";

//MARK: - 5.1.8
"Lost data recovery" = "استعادة البيانات المفقودة";
"Hard Drive" = "محرك الأقراص";
"Advanced recovery" = "استعادة المتقدم";
"Crashed Mac" = "تحطمت Mac";
"iCloud" = "iCloud";
"New" = "جديد";
"Corrupted file repair" = "إصلاح الملف التالف";
"Photo Repair" = "إصلاح الصورة";
"Video Repair" = "إصلاح الفيديو";
"Why Pro？" = "لماذا تختار النسخة المهنية؟";
"Unlock Pro to enjoy" = "فتح  للاستمتاع";
"Unlimited Recovery" = "استعادة غير محدود";
"Corrupted Repair" = "إصلاح تالف";
"Full Preview" = "معاينة كاملة";
"Unlock Pro Now" = "افتح النسخة المهنية الآن";
"Recover permanently & recently deleted iCloud data easily" = "يمكنك استعادة بيانات iCloud المحذوفة نهائيًا ومؤخرًا بسهولة";
"Recover any lost photos, videos, contacts, notes and more from iCloud directly" = "يمكنك استعادة أي صور وفيديو وجهات اتصال وملاحظات مفقودة والمزيد من iCloud مباشرةً";
"Get Started" = "بدء";
"Searching lost iCloud data..." = "جارٍ البحث عن بيانات iCloud المفقودة...";
"Search Completed" = "اكتمل البحث";
"Search Stopped" = "توقف البحث";
"Damaged or partitially missing photos" = "الصور التالفة أو المفقودة جزئيًا";
"Add photos for repair" = "أضف الصور لإصلاحها";
"Corrupted or unplayable vidoes" = "الفيديو التالفة أو المفقودة جزئيًا";
"Add videos for repair" = "أضف الفيديو لإصلاحها";
"Repair any damaged or photos that cannot be opened" = "إصلاح أي ملفات صور تالفة أو غير قابلة للتشغيل والمزيد";
"Repair any corrupted or unplayale videos files and more" = "إصلاح أي ملفات فيديو تالفة أو غير قابلة للتشغيل والمزيد";
//MARK: - v5.1.10
"Sign in to iCloud" = "تسجيل الدخول إلى iCloud";
"Apple ID" = "Apple ID";
"Password" = "كلمة المرور";
"Keep Password" = "احتفظ بكلمة المرور";
"Forget Apple ID or Password?" = "هل نسيت Apple ID أو كلمة المرور؟";
"Back" = "عاد";
"Log In" = "تسجيل الدخول";
"1. To prevent changes to iCloud, do not sync device data to iCloud while recovering." = "1. لمنع إجراء تغييرات على iCloud، لا تقم بمزامنة بيانات الجهاز مع iCloud أثناء الاستعادة.";
"2. We NEVER keep records of your account. For more details, please refer to our Privacy Policy." = "2. لا نحتفظ أبدًا بسجلات لحسابك. لمزيد من التفاصيل، يرجى الرجوع إلى سياسة الخصوصية لدينا.";
"Privacy Policy" = "سياسة الخصوصية";
"Incorrect Apple ID or password." = ".أو كلمة مرور غير صحيحة Apple ID ";
"For security reasons, your Apple ID is locked. Please unlock your account and try again." = "لأسباب أمنية، تم قفل Apple ID الخاص بك. يرجى فتح حسابك والمحاولة مرة أخرى.";
"Network disconnected. Please check your network connection and try again." = "تم قطع اتصال الشبكة. الرجاء التحقق من اتصال الشبكة والمحاولة مرة أخرى.";
"Two-factor authentication" = "توثيق ذو عاملين";
"A verification code message has been sent to your trusted device. Please enter the code to continue." = "تم إرسال رسالة رمز التحقق إلى جهازك الموثوق به. الرجاء إدخال الرمز للمتابعة.";
"Resend code" = "أعد إرسال الرمز";
"Get Help from Apple" = "احصل على المساعدة من Apple";
"Incorrect verification code." = "رمز التحقق غير صحيح.";
"Entered incorrect verification code too many times." = "تم إدخال رمز التحقق غير الصحيح عدة مرات.";
"Request failed, please try again." = "فشل الطلب، يرجى المحاولة مرة أخرى.";
"Verification requested too often" = "تم طلب التحقق كثيرًا";
"Network error. Please check your network connection." = "خطأ في الشبكة. الرجاء التحقق من اتصال الشبكة الخاصة بك.";
"Please select the type of data you want to recover." = "الرجاء تحديد نوع البيانات التي تريد استردادها.";
"Log Out" = "تسجيل خروج";
"Select all" = "اختر الكل";
"Refresh" = "ينعش";
"Back" = "عاد";
"Confirm" = "يتأكد";
"iCloud drive" = "محرك iCloud";
"Photos" = "الصور";
"Contacts" = "جهات الاتصال";
"Reminder" = "تذكير";
"Calendar" = "تقويم";
"Notes" = "ملحوظات";
//MARK: - 4ddig mac 5.1.10
"Home Phone" = "رقم البيت";
"Work" = "رقم العمل";
"iPhone" = "رقم الآيفون";
"Mobile Phone" = "رقم الهاتف المحمول";
"Main Phone" = "الرقم الرئيسي";
"HomeFax" = "رقم الفاكس السكني";
"WorkFax" = "فاكس العمل";
"Pager Phone" = "بيجر بيجر";
"Other Phone" = "أرقام أخرى";
"Home Email" = "Email للعائلة";
"Work Email" = "Email العمل";
"Other Email" = "Email الآخر";
"iCloud Email" = "iCloud Email";
"HomePage" = "الصفحة الرئيسية";
"Home Page" = "صفحة العائلة";
"Other Page" = "صفحة العمل";
"Work Page" = "صفحة أخرى";
"Title" = "عنوان";
"Starting Time" = "وقت البدء";
"List" = "قائمة";
"Status" = "حالة";
"Reminder time" = "وقت التذكير";
"Priority" = "أولوية";
"Location" = "موقع";
//MARK: - 第二批_3.21
"Company" = "شركة";
"School" = "مدرسة";
"Time" = "وقت";
"End Date Time" = "وقت تاريخ الانتهاء";
"Complete" = "مكتمل";
"Incomplete" = "غير مكتمل";
"Invited People" = "الأشخاص المدعوون";
"Flag Marks" = "علامات العلم";
"None" = "لا أحد";
"Low" = "قليل";
"Medium" = "واسطة";
"High" = "عالي";
"Unknown" = "مجهول";
//MARK: - 5.1.11
"Unsaved Documents" = "المستندات غير المحفوظة";
"Date Deleted" = "تاريخ الحذف";


//MARK: - PE
"Crashed Mac" = "تحطمت ماك";
"Create a bootable drive to boot up Mac for data recovery" = "إنشاء محرك أقراص قابل للتمهيد لتشغيل نظام Mac لاستعادة البيانات";
"What's Crashed Mac？" = "ما الذي تعطل ماك؟";
"Boot up Mac with the USB bootable drive for data recovery" = "قم بتشغيل الكمبيوتر لاستعادة البيانات عبر محرك أقراص تمهيد USB";
"Boot up crashed Mac" = "التمهيد تحطمت ماك";
"Tips: please try again with another USB drive Common Solutions" = "نصائح: يرجى المحاولة مرة أخرى باستخدام محرك أقراص USB آخر.
الحلول الشائعة";
"Common Solutions" = "الحلول المشتركة";
"Icon" = "أيقونة";
"Preview Pane" = "جزء المعاينة";
"Details" = "تفاصيل";
"Create Now" = "إنشاء الان";
"Lost Partition" = "التقسيم المفقود";

"Select a drive where you lost data to start recovering" = "حدد محرك الأقراص الذي فقدت فيه البيانات لبدء عملية استعادة";
"Drive didn't show up?" = "محرك الأقراص لا يظهر؟";
"Check Disk Connection" = "تحقق من اتصال القرص";
"To recover data from digital camera, please remove the SD card and connect it to Mac via card reader." = "لاستعادة البيانات من الكاميرا الرقمية، يرجى إزالة بطاقة SD وتوصيلها بجهاز Mac عبر قارئ البطاقات.";
"When the USB device cannot be recognized, please try to connnect it to the back USB ports for data recovery." = "عندما لا يمكن التعرف على جهاز USB، يرجى محاولة توصيله بمنافذ USB الخلفية لاستعادة البيانات.";
"For data recovery from mobile phones, you can download UltData - iOS." = "لاستعادة البيانات من الهواتف المحمولة، يمكنك تنزيل UltData - iOS.";
"Check Disk Status" = "تحقق من حالة القرص";
"Solution: Access Disk Utility, click the \"Mount\" button on the top menu bar, and then recover your data." = "الحل: قم بالوصول إلى أداة القرص، وانقر فوق الزر \"Mount\" الموجود في شريط القائمة العلوي، ثم قم باستعادة بياناتك.";
"Language_menu" = "لغة";
"Disk Utility" = "أداة القرص";
"Mount" = "تتعدد";
"1. Access \"Disk Utility\"" = "1. \"الوصول إلى \"أداة القرص";
"2. Click \"Mount\"" = "2. \"انقر فوق \"تتعدد";

//MARK: - V5.1.18
"Select a location to save the recovered data" = "حدد موقعًا لحفظ البيانات المستردة";
"You've selected %li files, %@" = "لقد قمت بتحديد ملفات %li، %@";
"%@ available" = "متاح%@";
"Perfectly enough disk space. Save now." = "مساحة كافية على القرص. احفظ الان.";
"Save to the %@ and you don’t have to worry about data loss anymore." = "احفظه في %@ ولا داعي للقلق بشأن فقدان البيانات بعد الآن.";
"Save Now" = "احفظ الان";
"Insufficient space available, change another location or save to the %@." = "المساحة المتوفرة غير كافية،تغيير موقع آخر أو احفظه على %@.";
"It is not recommended to save to the original disk (where the data is lost), as it may have the data to be overwritten and lost permanently." = "لا يُنصح بالحفظ على القرص الأصلي (حيث يتم فقدان البيانات)، لأنه قد يتم الكتابة فوق البيانات وفقدانها نهائيًا.";
"No permissions to read or write, change another location or save to the %@." = "لا توجد أذونات للقراءة أو الكتابة أو تغيير موقع آخر أو الحفظ في %@.";
"Insufficient space available in %@. Please change to another location to save." = "المساحة المتوفرة غير كافية في %@. يرجى التغيير إلى موقع آخر للحفظ.";
"Select Folder..." = "اختر مجلد...";
"Logging in..." = "تسجيل الدخول...";
"Please authorize login to your %@ in the browser" = "يرجى السماح بتسجيل الدخول إلى %@ الخاص بك في المتصفح";
"Authorization login failed" = "فشل تسجيل الدخول إلى التفويض";
"Please re-authorize or change to another location" = "يرجى إعادة التفويض أو التغيير إلى موقع آخر";
"Another Location" = "موقع آخر";
"Re-authorize" = "إعادة التفويض";
"Authorization successful. Please return to %@ to continue recovering data." = "تم التفويض بنجاح. يرجى العودة إلى %@ لمواصلة استعادة البيانات.";

//MARK: - V5.2.0
"Large & Old Files" = "الملفات الكبيرة والقديمة";
"Locate and remove unneeded files to free up disk space with ease" = "حدد موقع الملفات غير الضرورية وإزالتها لتحرير مساحة القرص بسهولة";
"Locate Files in Minutes" = "تحديد موقع الملفات في دقائق";
"Finding large or old files manually could take you hours, but with %@ you’ll be done within minutes." = "قد يستغرق البحث عن الملفات الكبيرة أو القديمة يدويًا ساعات، ولكن مع %@ ستنتهي في غضون دقائق.";
"Remove As You Wish" = "إزالة كما يحلو لك";
"Remove unneeded files to trash, another folder or permanently. It's always your call." = "إزالة الملفات غير الضرورية إلى سلة المهملات أو مجلد آخر أو بشكل دائم. إنها مكالمتك دائمًا.";
"%@ used" = "×× مستعمل";
"Scan Now" = "إفحص الآن";
"All Files" = "كل الملفات";
"Selected" = "المحدد";
"By Size" = "حسب الحجم";
"By Access Date" = "حسب تاريخ الوصول";
"Last Week" = "الأسبوع الماضي";
"Last Month" = "الشهر الماضي";
"Scanning %@" = "المسح %@";
"Looking for large & old files" = "البحث عن الملفات الكبيرة والقديمة";
"Stop Scanning" = "توقف عن المسح";
"No files found" = "لا توجد ملفات";
"Return to home and select another location to start over" = "عد إلى الصفحة الرئيسية واختر موقعًا آخر للبدء من جديد";
"Removing: %@" = "إزالة:%@";
"It may take some time..." = "قد يستغرق بعض الوقت...";
"Remove Completed" = "اكتملت الإزالة";
"Removed: %li files (%@)" = "تمت الإزالة: ملفات %li (%@)";
"Done" = "منتهي";
"Insufficient permissions to remove" = "الأذونات غير كافية للإزالة";
"No read/write permissions for NTFS partition, and it cannot be removed." = "لا توجد أذونات القراءة/الكتابة لقسم NTFS، ولا يمكن إزالته.";
"Insufficient space at target folder to remove" = "المساحة غير كافية في المجلد الهدف لإزالتها";
"Remove to another folder or remove permanently." = "إزالته إلى مجلد آخر أو إزالته نهائيًا.";
"No files selected" = "لم يتم تحديد أي ملفات";
"Remove Permanently" = "إزالة نهائيا";
"Remove to Trash" = "إزالة إلى سلة المهملات";
"Remove to Folder" = "إزالة إلى المجلد";
"Access Time" = "وقت الوصول";
"Open File Location" = "افتح مكان ملف";
"Return to home?" = "العودة إلى الصفحة الرئيسية؟";
"It is recommended to remove unwanted files before you return." = "يوصى بإزالة الملفات غير المرغوب فيها قبل العودة.";
"Return" = "يعود";
"Cancel" = "يلغي";
"Stop Scanning?" = "إيقاف المسح؟";
"%@ will be no longer looking for large & old files if you stop." = "لن يبحث %@ عن الملفات الكبيرة والقديمة إذا توقفت.";
"Stop Scanning" = "توقف عن المسح";
"Stop Removing?" = "إيقاف الإزالة؟";
"%@ will be no longer removing files remaining if you stop." = "لن يقوم %@ بإزالة الملفات المتبقية إذا توقفت.";
"Stop Removing" = "توقف عن الإزالة";
"Get Pro for Files Removal" = "احصل على النسخة المهنية لإزالة الملفات";
"Unlock Pro to remove unwanted large & old files, and enjoy more features, including unlimited data recovery." = "إلغاء قفل النسخة المهنية لإزالة الملفات الكبيرة والقديمة غير المرغوب فيها، واستمتع بمزيد من الميزات، بما في ذلك استعادة البيانات بشكل غير محدود.";
"Files available for removal" = "الملفات المتاحة للإزالة";
"Authorizing for %@, please wait..." = "جارٍ المصادقة على %@، يرجى الانتظار...";
"Calculating the available space in %@, please wait..." = "جارٍ حساب المساحة المتوفرة في %@، برجاء الانتظار...";
//MARK: - 第二批_20240626
"Extra tools" = "أدوات إضافية";
"Sort by %@" = "ترتيب %@";
"By Modified Date" = "حسب تاريخ التعديل";
//MARK: - 2. SD卡
"SD Card" = "بطاقة الذاكرة";
"Select a memory card where you lost data to start recovering" = "حدد بطاقة الذاكرة التي فقدت فيها البيانات لبدء عملية استعادة";
"SD card didn't show up?" = "بطاقة الذاكرة لا تظهر؟";
"No SD card connected" = "لم يتم توصيل بطاقة الذاكرة";
"Connect the memory card via card reader to start recovering photos or videos" = "قم بتوصيل بطاقة الذاكرة عبر قارئ البطاقات لبدء استعادة الصور أو الفيديو";
//MARK: - 视频重组
"Enhanced Video Recovery" = "تحسين استعادة الفيديو";
"Scan and match video fragments in any storage media through AI advanced algorithms to recover a complete and playable video" = "قم بمسح أجزاء الفيديو ومطابقتها في أي وسائط تخزين من خلال خوارزميات AI المتقدمة لاستعادة فيديو كامل وقابل للتشغيل";
"Repair & recover vidoes at the same time, providing one-stop video solution" = "استعادة وإصلاح الفيديو في نفس الوقت، مما يوفر حلاً شاملاً للفيديو";
"Easily recover & repair videos from any devices, such as Canon, Nikon, Sony, GoPro, and DJI, etc. Learn more" = "يمكنك استعادة الفيديو وإصلاحها بسهولة من أي جهاز، مثل Canon وNikon وSony وGoPro وDJI، وما إلى ذلك. اعرف المزيد";
"AI-Powered" = "دعم بAI";
"Mac OS 10.15 previous versions are not supported" = "لا يتم دعم الإصدارات السابقة من  Mac OS 10.15";
"Try 'Enhanced Video Recovery' with Mac OS 10.15 or later" = "جرّب \"تحسين استعادة الفيديو\" مع  Mac OS 10.15 أو إصدار أحدث";
"Select a drive where you lost vidoes to start recovering" = "حدد محرك الأقراص الذي فقدت فيه  الفيديو لبدء عملية استعادة";
"Tips: Don't know which drive to scan, as you're not sure where the vidoe was lost?" = "نصائح: لست متأكدًا من المكان الذي تم فقد الفيديو منه ومن أين سيتم مسحه ضوئيًا؟";
"Select the video format you want to recover" = "حدد تنسيق الفيديو الذي تريد استعادته";
"All videos" = "جميع الفيديو";
"Recovery duration: The more video types selected, the longer it will take." = "مدة الاستعادة: كلما زاد عدد أنواع الفيديو المحددة، كلما استغرق الأمر وقتًا أطول.";
"Device that the vidoes are from (optional)" = "الجهاز الذي يتم التقاط الفيديو منه (اختياري)";
"Note: correct source device contributes to the targeted and precise recovery, significantly improving the recovery quality." = "ملاحظة: يساهم جهاز المصدر الصحيح في الاستعادة المستهدف والدقيق، مما يؤدي إلى تحسين جودة الاسترداد بشكل كبير.";
"Confirm" = "يتأكد";
"Canon" = "Canon";
"GoPro" = "GoPro";
"Nikon" = "Nikon";
"Sony" = "Sony";
"Fujifilm" = "Fujifilm";
"DJI" = "DJI";
"Apeman" = "Apeman";
"Papago" = "Papago";
"Vantrue" = "Vantrue";
"Rexing" = "Rexing";
"Others" = "آحرون";
"Please select at least one video format for enhanced video recovery" = "الرجاء تحديد تنسيق فيديو واحد على الأقل للاستعادة المتقدم للفيديو";
"Select All" = "اختر الكل";
"AI" = "AI";
"Video enhanced recovering...some black screen and unplayable vidoes could be repaired by AI once it completes." = "جاري الاستعادة المتقدم للفيديو... بمجرد الانتهاء، سيقوم AI بإصلاح الفيديو التالفة التي لا يمكن تشغيلها مثل الشاشة السوداء";
"Learn more" = " اعرف المزيد";
